CEFSA - Centro Educacional da Fundação Salvador Arena |
FESA - Faculdade Engenheiro Salvador Arena | 
São Bernardo do Campo, 08 de março de 2025 | 
Heitor Santos Ferreira - RA: 081230042 - Engenharia de Computação - 6° Semestre - EC6 | 
Eletiva II - Ambientes Inteligentes | 
Professor Elias Kento Tomiyama

# TABELA DE 'LINKS'

### Importando bibliotecas

In [ ]:
#Importando bibliotecas
import pandas as pd

### Importando tabela

In [2]:
#Importando tabela a partir do caminho de arquivo
df_links = pd.read_csv(r'C:\Users\Heitor\OneDrive - Fundação Salvador Arena\6 - Sexto Semestre\Ambientes Inteligentes\grouplens-datasets-analysis\data\links.csv')

In [3]:
#Exibindo as cinco primeiras linhas da tabela
df_links.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

### Realizando correções

In [4]:
#Alterando nomes das colunas para melhor compreensão
df_links.rename(columns={'movieId': 'ID filme', 'imdbId': 'ID IMDB', 'tmdbId': 'ID TMDB'}, inplace=True)

In [5]:
#Exibindo as cinco primeiras linhas da tabela depois da primeira correção de nomes
df_links.head()

   ID filme  ID IMDB  ID TMDB
0         1   114709    862.0
1         2   113497   8844.0
2         3   113228  15602.0
3         4   114885  31357.0
4         5   113041  11862.0

In [6]:
#Corrigindo coluna "ID TMDB" que possuí espaços em float nulos e despreziveis
df_links["ID TMDB"] = df_links["ID TMDB"].fillna(0).astype(int)

In [7]:
#Exibindo as cinco primeiras linhas da tabela depois da da segunda correção de floats e nulos no campo "ID TMDB"
df_links.head()

   ID filme  ID IMDB  ID TMDB
0         1   114709      862
1         2   113497     8844
2         3   113228    15602
3         4   114885    31357
4         5   113041    11862

### Exibindo informações gerais sobre a tabela e realizando sua apresentação final

In [8]:
print(f'O dataset possui {df_links.shape[0]} exemplos/amostras/linhas e {df_links.shape[1]} atributos/variáveis/colunas.')

O dataset possui 9742 exemplos/amostras/linhas e 3 atributos/variáveis/colunas.

In [ ]:
#Exibindo informações sobre o 'dataframe' no qual a tabela se encontra registrado
df_links.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ID filme  9742 non-null   int64
 1   ID IMDB   9742 non-null   int64
 2   ID TMDB   9742 non-null   int32
dtypes: int32(1), int64(2)
memory usage: 190.4 KB

In [10]:
df_links.describe()

            ID filme       ID IMDB        ID TMDB
count    9742.000000  9.742000e+03    9742.000000
mean    42200.353623  6.771839e+05   55116.825395
std     52160.494854  1.107228e+06   93628.351521
min         1.000000  4.170000e+02       0.000000
25%      3248.250000  9.518075e+04    9656.750000
50%      7300.000000  1.672605e+05   16497.500000
75%     76232.000000  8.055685e+05   44147.750000
max    193609.000000  8.391976e+06  525662.000000